"""
Завдання 7: Створіть програму, яка виводить таблицю з інформацією про акції. 
У таблиці повинні бути такі стовпці: "Name", "Shares", "Price", "Change". 
Використовуйте форматування, щоб:
- "Name" займав 10 символів і вирівнювався вліво.
- "Shares" займав 10 символів і вирівнювався вправо.
- "Price" займав 10 символів, відображався з символом долара та двома знаками після коми.
- "Change" займав 10 символів, відображався з двома знаками після коми та зі знаком відсотка.
"""

stocks = [
    {"name": "AA", "shares": 100, "price": 9.22, "change": -22.98},
    {"name": "IBM", "shares": 50, "price": 106.28, "change": 15.18},
    {"name": "CAT", "shares": 150, "price": 35.46, "change": -47.98},
    {"name": "MSFT", "shares": 200, "price": 20.89, "change": -30.34},
    {"name": "GE", "shares": 95, "price": 13.48, "change": -26.89},
    {"name": "MSFT", "shares": 50, "price": 20.89, "change": -44.21},
    {"name": "IBM", "shares": 100, "price": 106.28, "change": 35.84}
]

# Виводимо заголовки таблиці
print(f"{'Name':<10} {'Shares':>10} {'Price':>10} {'Change':>10}")

# Виводимо дані про кожну акцію
for stock in stocks:
    
    name = f"{stock['name']:<10}"  # вліво, 10 символів
    shares = f"{stock['shares']:>10}"  # вправо, 10 символів
    price = f"{stock['price']:>8.2f}$"  # з символом долара, 2 знаки після коми
    change = f"{stock['change']:>7.2f}%"  # з знаком відсотка, 2 знаки після коми
    
    print(f"{name} {shares} {price} {change}")